rjaremczak/radio3-stm32/src/board.c
/*
 * Radio3 - general purpose tool for hams
 * Author: Robert Jaremczak, SQ6DGT
 *
 * LED control functions.
 *
 */

#include <stm32f10x.h>
#include <board.h>

#define LED_GPIO			GPIOC
#define LED_BOARD_PIN		GPIO_Pin_13

#define LED_BIT_ACTION(on)	(on ? Bit_RESET : Bit_SET)

void board_init() {
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	GPIO_InitTypeDef gpi;
	gpi.GPIO_Pin = LED_BOARD_PIN;
	gpi.GPIO_Speed = GPIO_Speed_50MHz;
	gpi.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_Init(LED_GPIO, &gpi);
	GPIO_SetBits(LED_GPIO, LED_BOARD_PIN);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    gpi.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    gpi.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpi);
    GPIO_SetBits(GPIOB, gpi.GPIO_Pin);
}

void board_integrated_led(uint8_t on) {
	GPIO_WriteBit(LED_GPIO, LED_BOARD_PIN, LED_BIT_ACTION(on));
}

void board_led_green(uint8_t on) {
    GPIO_WriteBit(GPIOB, GPIO_Pin_13, LED_BIT_ACTION(on));
}

void board_led_yellow(uint8_t on) {
    GPIO_WriteBit(GPIOB, GPIO_Pin_14, LED_BIT_ACTION(on));
}

void board_buzzer(uint8_t on) {
    GPIO_WriteBit(GPIOB, GPIO_Pin_15, LED_BIT_ACTION(on));
}